Program vano;
{Задача:
Даны натуральные числа N, действительные числа А1..Аn.
В последовательности А1..Аn все нотрицательные члены, не
принадлежащие отрезку [1..2] заменить на единицу. Кроме того,
получить число отрицательных членов и членов принадлежащих отрезку.}
uses crt; {Подключаем модуль управления экраном CRT}
var
matr :array[1..100] of real; {Создаем массив в 100 элементов}
x,otrelem,prinelem,N :integer; {Создаем переменные для
цикла, отрицательных элементов, принадлежащих промежутку [1..2]
элементов, размерности массива}
begin
clrscr; {Стираем экран}
writeln('Введите колличество элементов массива'); {Пишем строчку}
readln(N); {Считываем размерность массива}

for x:=1 to N do {Это цикл ввода значений массива}
begin
write('X[',x,'] = ');
readln(matr[x]);
end;

for x:=1 to N do {Это цикл расчета ответов}
begin
write(matr[x]:15:2);
{Записываем старое значение элемента массива на экран}
if matr[x]<0 then otrelem := otrelem+1;
{Находим отрицательные элементы}
if (matr[x]>=1) and (matr[x]<=2) then prinelem:=prinelem+1;
{Находим элементы принадлежащие промежутку [1..2]}
if (matr[x]>=0) and (matr[x]<1) or (matr[x]>2) then matr[x] := 1;
{находим неотрицательные, не принадлежащие промежутку [1..2] элементы}
writeln(matr[x]:15:2);
{Записываем новое значение элемента массива на экран}
end;

{Выводим ответы}
writeln('Число отрицательных членов = ',otrelem);
writeln('Число членов пренадлежащих отрезку [1..2] = ',prinelem);
readln;
end.

